ЧартерEDT.Расширение1/src/Catalogs/чартер_Файлы/чартер_Файлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>чартер_Файлы</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецФайла</name>
    <type>
      <types>CatalogRef.чартер_Рейсы</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазмерФайла</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасширениеФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Файл</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Архив</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

ЧартерEDT.Расширение1/src/Catalogs/чартер_Файлы/ManagerModule.bsl
Функция ПолучитьСтруктуруДанныхФайла(ФайлСсылка) Экспорт
	
	ФайлСтруктура = Новый Структура;
	ФайлСтруктура.Вставить("Наименование", ФайлСсылка.Наименование);
	ФайлСтруктура.Вставить("ПолноеИмяФайла", ФайлСсылка.ПолноеИмяФайла);
	ФайлСтруктура.Вставить("ИмяФайла", ФайлСсылка.ИмяФайла);
	ФайлСтруктура.Вставить("РасширениеФайла", ФайлСсылка.РасширениеФайла);
	ФайлСтруктура.Вставить("Адрес", ПолучитьАдресВременногоХранилищаФайла(ФайлСсылка));
	ФайлСтруктура.Вставить("РазмерФайла", ФайлСсылка.РазмерФайла);
	
	Возврат ФайлСтруктура;
	
КонецФункции

Функция ПолучитьАдресВременногоХранилищаФайла(ФайлСсылка)
	
	Возврат ПоместитьВоВременноеХранилище(ФайлСсылка.Файл.Получить(), Новый УникальныйИдентификатор);
	
КонецФункции
